import { Break, type MultitextItem } from "../../../elements/TextBlock/MultiText/MultiTextItem";
import elizaB from '../../../../assets/images/Teachers/Eliza_B.jpg'

import img2 from "../../../../assets/images/Articles/Project/project2.jpg"
import img3 from "../../../../assets/images/Articles/Project/project3.jpg"
import img4 from "../../../../assets/images/Articles/Project/project4.jpg"
import img5 from "../../../../assets/images/Articles/Project/project5.jpg"

const contents : MultitextItem[] = [
    {
        image : elizaB,
        text : [
            {
                bold : 'Елизавета Бычковская',
            },
            Break, Break,
            'Учитель начальных классов высшей квалификационной категории',
            Break, Break,
            '6 октября 2024г',
            Break, Break,
            'г.Королёв, Московская область',
        ],
    },
    {
        bold : 'Проектная деятельность в семейной школ',
        fontSize : '30px',
        variant : 'h2',
    },
    'Что мы, родители, общество, государство, хотим сегодня от детей?',
    Break,
    'И чего хотят сами дети, когда приходят в школу учиться?',
    Break,
    'Есть ли что-то общее у этих двух сфер?',
    Break,
    'И как нам, учителям, удовлетворять эти запросы? Реально ли это?',
    Break,
    'Такими вопросами задается сейчас современное педагогическое сообщество. И, создавая нашу семейную школу, мы – коллектив учителей Clover English – постоянно думаем над тем, что мы можем сделать, чтобы развитие детей шло в соответствии как с интересами самого ребенка, так и общества. И а наших статьях делимся с вами своим видением решения этой проблемы.',
    Break,
    {
        multitext : [
            'Запросы государства отражены в ФГОС (Федеральные государственные стандарт образования). Согласно этому документу, выпускник школы должен быть:',
            Break, Break,
            {
                list : [
                    'Запросы государства отражены в ФГОС (Федеральные государственные стандарт образования). Согласно этому документу, выпускник школы должен быть:',
                    'любознательным, активно и заинтересованно познающим мир;',
                    'умеющим учиться, способным к организации собственной деятельности;',
                    'готовым самостоятельно действовать и отвечать за свои поступки перед семьей и обществом;',
                    'доброжелательным, умеющим слушать и слышать собеседника, обосновывать свою позицию, высказывать свое мнение;',
                    'выполняющим правила здорового и безопасного для себя и окружающих образа жизни.',
                    
                ],
            }
        ],
    },
    Break,
    'А как нам понять, чего хотят сами дети? Как нам услышать и увидеть детей за толстым слоем наших ожиданий?',
    Break,
    'На помощь приходит проектная деятельность.',
    Break, 
    'Проект – это идея ребенка, отработанная на практике и оформленная в виде конечного продукта (плаката, поделки, презентации исследовательской работы, хореографической постановки, спектакля или инсценировки, макета изделия, настольной игры, сборника собственных задач, литературного сочинения или живописной картины и т.д).',
    Break,
    'От задумки проекта до его реализации ребёнок проходит несколько этапов.',
    Break,
    '1.Поиск и выделение самой проблемы/идеи.',
    'На этом этапе ребенок проявляет любознательность, выбирает интересную для себя сферу деятельности, думает над тем, чем может быть полезен обществу.',
    Break,
    '2.Планирование хода работы над проектом.',
    'Ребёнок учится организовывать свою деятельность, ставить перед собой задачи, продумывать свои действия на несколько шагов вперед.',
    Break,
    '3.Поиск и отбор необходимой информации, ее анализ.',
    'Ребёнку необходимо собрать информацию, подобрать материалы, приобрести дополнительные умения и навыки, необходимые для выполнения проекта.',
    Break,
    '4.Изготовление самого продукта.',
    'Здесь отрабатываются и закрепляются все основные компетенции, которые начали формироваться на предыдущих этапах. Если ранее что-то было сделано недостаточно хорошо, то как раз сейчас ребёнок столкнётся с последствиями своих действий. То есть ребёнок учится быть ответственным и самостоятельным.',
    Break,
    '5.Презентация проекта.',
    'Рассказать и показать людям результат своей работы – это и есть та самая возможность себя проявить. Это очень важный момент формирования личности: дети, которые знакомятся с проектом своего одноклассника, учатся слушать и слышать, высказывать свое мнение, задавать вопросы, проявлять интерес к чужому труду, становятся более доброжелательными и поддерживающими.',
    Break,
    '6.Рефлексия.',
    'Ребёнку важно понять: а что это вообще было, удалось ли мне реализовать задуманное, какой этап вызвал сложность, что мне понравилось делать больше всего, хочется ли дальше развиваться в этом направлении или уже пора сменить вектор.',
    Break,
    'В первом классе дети выполняют простые проекты, и все пять обозначенных выше этапов обычно проходят в течение одного- двух уроков. Но по мере взросления детей, проекты усложняются, каждый этап может занимать несколько дней, недель или даже месяцев. Но суть от этого не меняется. С одной стороны, проекты дают возможность нам, учителям и родителям, понять, что сейчас интересно ребёнку, и исходя из этого, мы можем предложить ему дальнейшую траекторию развития. С другой стороны, сам ребенок может лучше понять себя, свои интересы, свою ценность, а также повысить уровень своей субъектности.',
    Break,
    'Приведем пример проекта на тему «Осенние изменения в природе» ученицы 1-го класса нашей семейной школы.',
    Break,
    '1.Идея/проблема',
    'Идёт осень, наш кабинет украшен осенними листьями, но нет плаката, который подробно бы рассказывал о том, какие изменения происходят осенью. Так возникла идея украсить кабинет новым плакатом.',
    Break,
    '2.Планирование хода работы',
    'Сначала мы записали на большом листе бумаги названия трёх осенних месяцев. Потом под каждым из них наша ученица Варя записала и нарисовала, что она хочет видеть на плакате в разделе каждого месяца – стихотворение, пословицу, рисунок. Затем Варя определилась с тем, что ей для этого понадобиться: лист ватмана, компьютер и принтер, ножницы, клей, карандаши и фломастеры.',
    Break,
    '3.Поиск информации',
    'Во время прогулок Варя собирала листья для гербария. На занятии по проектной деятельности учительница помогла Варе подобрать стихи и пословицы, найти в интернете нужные картинки, распечатать их. Варя вырезала всё, что ей было нужно.',
    Break,
    '4.Изготовление продукта',
    'Варя написала на ватмане слово «Осень» разными цветами, которые по ее мнению соответствуют этому времени года. Затем написала названия месяцев. Далее Варя разместила весь свой подготовленный материал в разделе каждого месяца и нарисовала иллюстрации. В конце украсила плакат листьями из гербария.',
    Break,
    '5.Презентация',
    'Для того, чтобы Варя смогла представить свое прект, учительница помогла Варе составить рассказ. Затем плакат был представлен родителям, детям и младшему брату.',
    Break,
    '6.Рефлексия',
    'Варя рассказала нам, что больше всего ей понравилась та часть работы, которую она делала полностью сама: вырезать, приклеивать, рисовать, собирать листья. А главным моментом для нее стала сама презентация, то есть возможность рассказывать, когда тебя все слушают.',
    Break,
    'Для нас, учителей, важно, что, создавая свой проект, наша ученица занималась тем, чем она хотела заниматься, и при этом приобретала нужные ей умения и навыки, в соответствии с внешними запросами государства и общества.',
    Break, Break,
    {
        imageSource : img2,
        width : '20%',
    },
    Break,
    {
        imageSource : img3,
        width : '20%',
    },
    Break,
    {
        imageSource : img4,
        width : '20%',
    },
    Break,
    {
        imageSource : img5,
        width : '20%',
    },
]

export const ProjectPage = {
    contents : contents,
}