import { Break, type MultitextItem } from "../../../../component/elements/TextBlock/MultiText/MultiTextItem"
import mariaP from "../../../../assets/images/Teachers/Maria_P.png"

const contents : MultitextItem[] = [
    {
        
                image : mariaP,
                width : '50%',
                text : [
                    {
                        bold : 'Мария Парфёнова,',
                    },
                    Break,
                    `преподаватель английского языка детям, взрослым,`,
                    Break, Break,
                    'подготовка к ОГЭ и ЕГЭ,', Break,
                    'г.Королёв',
                ]
    },
    Break, Break,
    {
        bold : '7 привычек, чтобы интегрировать английский в свою жизнь',
        fontSize : '30px',
    },
    Break, Break,
    {
        multitext : [
            'Меня зовут Мария, я преподаватель английского языка для детей и взрослых в Королёве. Я поделюсь с вами отлично работающими приёмами, которые помогут сделать английский неотъемлемой частью вашей жизни.',
            Break,
            'Знание английского языка открывает перед вами новые двери как в карьере, так и в повседневной жизни. Ваши возможности по самореализации расширяются, жизнь становится интереснее, появляются новые впечатления и новый опыт. И всего 7 привычек могут приблизить вас к хорошему знанию языка.',
        ]
    },

    {
        multitext : [
            '1) Начинайте утро с просмотра новостной ленты иностранных изданий.',
            Break,
            'Вместо чтения любимых русскоязычных Telegram-каналов заходите на известные англоязычные новостные ресурсы, например, The Washington Post, CNN, The Guardian и другие. Регулярный просмотр новостной ленты поможет вам значительно расширить словарный запас, научиться понимать необычные предложения, познакомиться с новостным сленгом, а также всегда быть в новостной повестке других стран!',
        ]
    },
    Break,
    Break,
    {
        multitext : [
            '2) Добавьте словарь в избранное',
            Break,
            'При изучении языка без словаря никуда. Как только вы встречаете новое слово, воспользуйтесь онлайн-словарями: Cambridge Dictionary или Oxford English Dictionary. В словарях вы найдёте как объяснение слова, так и контекст его использования. Это поможет вам понять, где и как применять новую лексику! И заведите словарик, в который будете копировать те слова, которые хотите запомнить надолго.',
        ]
    },
    Break, Break,
    {
        multitext : [
            '3) Ищите больше синонимов в словарях',
            Break,
            'Изучили новое слово? Найдите для него сразу 2 или 3 синонима. Часто наша речь звучит скудно из-за использования одних и тех же слов. Однако замена даже одного слова поможет разнообразить ваш рассказ, высказать свою мысль более точно и выглядеть лучше в глазах собеседника из другой страны.'
        ]
    },
    Break, Break,
    {
        multitext : [
            '4) Проверяйте стиль речи, к которому относится слово',
            Break,
            'Далеко не каждый синоним может быть использован как полноправная замена. Например, существительным skinflint («жадина») в нейтральных текстах не стоит заменять прилагательное mean («жадный»), так как это разговорная форма, к тому же имеющая оскорбительное значение. Найти информацию о стиле слов можно в словарях.'
        ]
    },
    Break, Break,
    {
        multitext : [
            '5) Повторяйте речь за носителями',
            Break,
            'Выбирайте интересный вам контент, смотрите его в оригинале, включайте субтитры и повторяйте фразы за любимыми героями - Тони Старком, Шерлоком Холмсом или популярным политиком. Однако помните о диалектах и старайтесь выбирать для практики носителей традиционного британского или американского английского.',
            
        ],

    },
    Break, Break,
    {
        multitext : [
            '6) Читайте статьи в оригинале',
            Break,
            'Появился вопрос? Старайтесь найти на него ответ на английском языке. Например, если сломался велосипед, попробуйте сначала загуглить How to fix a bike и потратить 10-15 минут на чтение инструкций, советов и рекомендаций на английском языке, а уже потом переходите к инструкциям на русском. Как правило со временем отпадает необходимость обращаться к инструкциям на русском языке, так как становится всё понятно и на английском. Просмотр видеороликов по заданной теме тоже может быть полезным.',
            Break,
            'Для более длительного и вдумчивого чтения подойдут научно-популярные статьи на Google Scholar: от психологии животных до основ ядерной физики. Изучение работ учёных поможет расширить лексический запас для разных тем и пригодится в любых проектах.',
        ],
        
    },
    Break, Break,
    {
        multitext : [
            '7) Употребляйте новые слова минимум 7 раз',
            Break,
            'Учёные убеждены, что для запоминания нового слова нам нужно употребить его минимум 7 раз. Так что, добавляя новое слово в словарик, старайтесь в ближайшее время использовать его в разных контекстах. Для этого я советую проговаривать про себя все свои ежедневные дела, впечатления и мысли на английском языке. Начните с перечисления на английском всех предметов, которые встречаются вам по пути из дома на работу, составляйте с ними предложения, сравнивайте эти предметы с тем, какими они были вчера, неделю назад, в прошлом году и т.д.',
            Break,
            'А если вам необходимо улучшить свой английский для работы или вы хотите найти собеседника для изучения слов и подробнее проработать интересующие вас темы на английском, буду рада видеть вас на своих оффлайн уроках по английскому языку для взрослых в Королёве!',
        ],
        
    },
    Break, Break,
]

export const Page7Habits = {
    contents : contents,
}